app/Controllers/Employee.php

    public function index()
    {
        $model = new EmployeeModel();
        $data = $model->findAll();
---
SELECT *
FROM `employee`

    public function show($id = null)
    {
        $model = new EmployeeModel();

         $data = $model->getWhere(['id'=>$id]);
---
SELECT *
FROM `employee`
WHERE `id` = '2'

    public function create()
    {
        $model = new EmployeeModel();
        $data = [
            'nama_lengkap' => $this->request->getVar('nama_lengkap'),
            'tempat_lahir' => $this->request->getVar('tempat_lahir'),
            'tgl_lahir' => $this->request->getVar('tgl_lahir'),
            'email' => $this->request->getVar('email'),
            'phone' => $this->request->getVar('phone'),
            'pekerjaan' => $this->request->getVar('pekerjaan'),
            'gaji' => $this->request->getVar('gaji')
        ];
        $model ->insert($data);
---
INSERT INTO `employee` (`nama_lengkap`, `tempat_lahir`, `tgl_lahir`, `email`, `phone`, `pekerjaan`, `gaji`) VALUES ('tes', NULL, NULL, NULL, NULL, NULL, NULL)

    public function delete($id = null)
    {
        $model = new EmployeeModel();
        $data = $model->find($id);
        if($data){
            $model->delete($id);
---
SELECT *
FROM `employee`
WHERE `employee`.`id` = '2'
DELETE FROM `employee`
WHERE `id` IN ('2')